docs/Example-org-to-Klipse_re-frame.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-04 Sat 23:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data-driven tooltips (popovers) in re-frame</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Damian Hryniewicz" />
<link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css" />
</head>
<body>
<div id="content">
<h1 class="title">Data-driven tooltips (popovers) in re-frame</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge922f0c">1. That’s where re-frame kicks in!</a></li>
</ul>
</div>
</div>
<p>
Klipsifying bits from <a href="https://medium.com/magnetcoop/data-driven-tooltips-popovers-in-re-frame-de70d5412151">https://medium.com/magnetcoop/data-driven-tooltips-popovers-in-re-frame-de70d5412151</a>
</p>



<p>
Most of our projects have a need to display tooltips. Those tooltips can vary in purpose. They can be as simple as some text that appears on hover. But sometimes it has to be an interactive element. Think of a contextual menu that appears on right mouse click. How do you close that tooltip?
</p>

<p>
First there is most obvious way — if you opened it with a button then close it with a button.
</p>

<pre><code class="language-reagent">
(let [display-tooltip? (reagent/atom false)]
  (fn []
    [:div.tooltip-controller
     [:button
      {:on-click #(swap! display-tooltip? not)}
      "spawn tooltip"]
     (when @display-tooltip?
       [:div.tooltip.tooltip--bottom
        [:button {:on-click #(reset! display-tooltip? false)} "x"]
        [:p "Hello there!"]])]))
</code></pre>

<p>
Sure, it’s dead simple. But it’s completely uncontrollable from outside this element.
</p>



<p>
I’m no UX expert but I’m pretty sure that user expects that the tooltip will hide also when he/she clicks anywhere else.
</p>

<p>
In previous projects we were implementing this behaviour by leveraging React’s lifecycle methods. A tooltip, when spawned, used <code>component-did-mount</code> to create a listener on document to listen for clicks. If that click happened outside of that tooltip controller, the tooltip was destroyed. But there’s still that listener hanging. <code>component-will-unmount</code> in the tooltip was destroying that listener.
</p>

<pre><code class="language-reagent">
(defn find-tooltip-controller-class [node]
  (or (some-> node
              .-classList
              (.contains "js-tooltip-controller"))
      (some-> (.-parentNode node) (find-tooltip-controller-class))))

(defn tooltip [display-tooltip?]
  (let [click-handler (fn [e]
                        (.stopPropagation e)
                        (when-not (find-tooltip-controller-class (.. e -target))
                          (reset! display-tooltip? false)))]
    (r/create-class
      {:reagent-render (fn []
                         [:div.tooltip.tooltip--bottom
                          [:button {:on-click #(reset! display-tooltip? false)} "x"]
                          [:p "Hello there!"]])
       :component-did-mount #(.addEventListener js/document "click" click-handler)
       :component-will-unmount #(.removeEventListener js/document "click" click-handler)})))

(defn main []
  (let [display-tooltip? (r/atom false)]
    (fn []
      [:div.tooltip-controller.js-tooltip-controller
       [:button
        {:on-click #(swap! display-tooltip? not)}
        "spawn tooltip"]
       (when @display-tooltip?
         [tooltip display-tooltip?])])))
</code></pre>

<p>
The approach above worked, but required using lifecycle methods. Reagent community advises not to do it.
</p>

<div id="outline-container-orge922f0c" class="outline-2">
<h2 id="orge922f0c"><span class="section-number-2">1</span> That’s where re-frame kicks in!</h2>
<div class="outline-text-2" id="text-1">
<p>
Markup of the elements that use tooltips will remain very much the same. The difference is that now the information whether a tooltip should be displayed or not will be stored in re-frame’s appdb. This is an example appdb state:
</p>

<pre class="example">
{… …
 :tooltips-controls {"id111" {:id "id111"
                              :destroy-on-click-out? true}
                     "id222" {:id "id222"
                              :destroy-on-click-out? false}}
 … …}
</pre>
<p>
As you can see above, it’s a map of maps. Each individual map represents one tooltip. In the markup you should have a tooltip that subscribes to its respective tooltip control data. If it is there, then it means that that tooltip should be spawned.
</p>

<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">hello-tooltip</span> [id]
  [<span style="color: #008b8b;">:div.tooltip.tooltip--bottom</span>
   [<span style="color: #008b8b;">:button</span> {<span style="color: #008b8b;">:on-click</span> #(<span style="color: #228b22;">rf</span>/dispatch [<span style="color: #008b8b;">::</span><span style="color: #228b22;">tooltip</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">destroy-by-id</span> id])} <span style="color: #8b2252;">"x"</span>]
   [<span style="color: #008b8b;">:p</span> <span style="color: #8b2252;">"Hello there!"</span>]])

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">main</span> []
  (<span style="color: #a020f0;">let</span> [tooltip-id <span style="color: #8b2252;">"my-first-tooltip"</span>
        tooltip-data (<span style="color: #228b22;">rf</span>/subscribe [<span style="color: #008b8b;">::</span><span style="color: #228b22;">tooltip</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">by-id</span> tooltip-id])]
    (<span style="color: #a020f0;">fn</span> []
      [<span style="color: #008b8b;">:div.tooltip-controller.js-tooltip-controller</span>
       {<span style="color: #008b8b;">:class</span> (<span style="color: #228b22;">tooltip</span>/gen-controller-class tooltip-id)}
       [<span style="color: #008b8b;">:button</span>
        {<span style="color: #008b8b;">:on-click</span> #(<span style="color: #a020f0;">if</span> @tooltip-data
                      (<span style="color: #228b22;">rf</span>/dispatch [<span style="color: #008b8b;">::</span><span style="color: #228b22;">tooltip</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">destroy-by-id</span> tooltip-id])
                      (<span style="color: #228b22;">rf</span>/dispatch [<span style="color: #008b8b;">::</span><span style="color: #228b22;">tooltip</span><span style="color: #000000; background-color: #ffffff;">/</span><span style="color: #008b8b;">register</span> {<span style="color: #008b8b;">:id</span> tooltip-id}]))}
        <span style="color: #8b2252;">"spawn tooltip 1"</span>]
       (<span style="color: #a020f0;">when</span> @tooltip-data
         [hello-tooltip tooltip-id])])))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #a020f0;">ns</span> <span style="color: #228b22;">myapp.tooltip</span>
  (<span style="color: #008b8b;">:require</span> [re-frame.core <span style="color: #008b8b;">:as</span> rf]
            [clojure.string <span style="color: #008b8b;">:as</span> str]))

(<span style="color: #a020f0;">def</span> ^<span style="color: #008b8b;">:const</span> <span style="color: #a0522d;">controller-class-prefix</span> <span style="color: #8b2252;">"js-tooltip-controller-"</span>)
(<span style="color: #a020f0;">def</span> ^<span style="color: #008b8b;">:const</span> <span style="color: #a0522d;">controller-class-pattern</span>
  (re-pattern (str controller-class-prefix <span style="color: #8b2252;">"([</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252;">w</span><span style="color: #8b2252; font-weight: bold;">\\</span><span style="color: #8b2252;">-]+)"</span>)))

(<span style="color: #228b22;">rf</span>/reg-sub
 <span style="color: #008b8b;">::controls</span>
 (<span style="color: #a020f0;">fn</span> [db _]
   (<span style="color: #008b8b;">:tooltip-controls</span> db)))

(<span style="color: #228b22;">rf</span>/reg-sub
 <span style="color: #008b8b;">::by-id</span>
 (<span style="color: #a020f0;">fn</span> [db _]
   (<span style="color: #228b22;">rf</span>/subscribe [<span style="color: #008b8b;">::controls</span>]))
 (<span style="color: #a020f0;">fn</span> [tooltips-controls [_ id]]
   (get tooltips-controls id)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">default-tooltip-data</span> []
  {<span style="color: #008b8b;">:id</span> (str (random-uuid))
   <span style="color: #008b8b;">:destroy-on-click-out?</span> <span style="color: #008b8b;">true</span>})

(<span style="color: #228b22;">rf</span>/reg-event-db
 <span style="color: #008b8b;">::register</span>
 (<span style="color: #a020f0;">fn</span> [db [_ data]]
   (<span style="color: #a020f0;">let</span> [data (merge (<span style="color: #a020f0;">default-tooltip-data</span>) data)]
     (assoc-in db [<span style="color: #008b8b;">:tooltip-controls</span> (<span style="color: #008b8b;">:id</span> data)] data))))

(<span style="color: #228b22;">rf</span>/reg-event-db
 <span style="color: #008b8b;">::destroy-by-id</span>
 (<span style="color: #a020f0;">fn</span> [db [_ id]]
   (update db <span style="color: #008b8b;">:tooltip-controls</span> dissoc id)))

(<span style="color: #228b22;">rf</span>/reg-event-db
 <span style="color: #008b8b;">::destroy-by-ids</span>
 (<span style="color: #a020f0;">fn</span> [db [_ ids]]
   (update db <span style="color: #008b8b;">:tooltip-controls</span>
           #(apply dissoc <span style="color: #a0522d;">%</span> ids))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">find-tooltip-controller-class-in-node</span> [node]
  (some-&gt;&gt; (.-className node)
           (re-find controller-class-pattern)
           (first)))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">find-tooltip-controller-class</span> [node]
  (<span style="color: #a020f0;">or</span> (find-tooltip-controller-class-in-node node)
      (some-&gt; (.-parentNode node) (find-tooltip-controller-class))))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">destroy-on-click-out</span> [clicked-node]
  (<span style="color: #a020f0;">let</span> [clicked-controller (some-&gt;
                            (find-tooltip-controller-class clicked-node)
                            (<span style="color: #228b22;">str</span>/split controller-class-prefix)
                            (second))
        controls-ids (<span style="color: #a020f0;">-&gt;&gt;</span> @(<span style="color: #228b22;">rf</span>/subscribe [<span style="color: #008b8b;">::controls</span>])
                          (vals)
                          (filter <span style="color: #008b8b;">:destroy-on-click-out?</span>)
                          (map <span style="color: #008b8b;">:id</span>)
                          (set))]
    (<span style="color: #228b22;">rf</span>/dispatch [<span style="color: #008b8b;">::destroy-by-ids</span> (disj controls-ids clicked-controller)])))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">gen-controller-class</span> [tooltip-id]
  {<span style="color: #008b8b;">:pre</span> (string? tooltip-id)}
  (str controller-class-prefix tooltip-id))
</pre>
</div>

<p>
And here it is! And look how easy it is to make it more
configurable. In line 58 of <code>tooltip.cljs</code> you can see that I’m
filtering only the tooltips that have <code>:destroy-on-click-out?</code> set to
<code>true</code>. That’s all it took to make a popover resist being deleted when
user clicks outside that controller.
</p>


<script type="text/javascript">window.klipse_settings = {selector: '.src-clojure'};</script>
<script src="https://storage.googleapis.com/app.klipse.tech/plugin/js/klipse_plugin.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-05-03 Fri 00:00</p>
<p class="author">Author: Damian Hryniewicz</p>
<p class="date">Created: 2019-05-04 Sat 23:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
